[
  {
    "location": "Charlottesville, VA, 22903",
    "description": "We are in need of more Route Drivers to help deliver meals to our elderly home-bound neighbors in the Charlottesville Community. We deliver in Charlottesville City and Albemarle County. Each route takes at most, an hour of your time. Pick-up time is between 10:30AM and 11:00AM at 704 Rose Hill Drive.\n\n\nOnce you are entered into our Volunteer Portal, you can create your own schedule and sign up for shifts online at your convienence!\n\n\nIf you're interested, please reach out to our volunteer manager, Abbie Wilson at volunteer@cvillemeals.org or give us a call at 434-293-4364.",
    "causes": [
      "Advocacy & Human Rights",
      "Hunger",
      "Seniors"
    ],
    "goodFor": [
      "Kids",
      "Teens",
      "People 55+",
      "Public Groups",
      "Private Groups"
    ],
    "skills": [
      "Elder care",
      "Food Delivery / Distribution",
      "Fundraising",
      "People Skills",
      "Relationship Building"
    ],
    "missionStatement": "Our service's goal is to not only provide healthy food, but also meaningful and daily social interaction to people in the Charlottesville area who would otherwise not be checked on or fed. We are a Monday-Friday operation. Volunteer Meal-Packers are needed between 9:00AM-10:15AM. Volunteer Route-Drivers are needed to pick up their meals between 10:30AM-11:00AM. Route-Times vary in length from approximately 20-60 minutes depending on the mileage and number of clients. Meals on Wheels currently serves over 250 clients each and every day, and that would not be possible without the work of our incredible volunteer base! We are truly thankful for every single volunteer who walks through our door and we make it a priority here to support them as much as they support our organization.",
    "organizationDescription": "Meals on Wheels of Charlottesville/Albemarle is a non-profit organization founded in 1977 to deliver hot, nutritious meals to our homebound neighbors in the area dealing with food insecurity. Meals on Wheels works to help better the health and support the independence and dignity of our community members struggling with financial, physical, and mental health challenges affecting their access to food. Food is a basic human right that our team has and always will strive to protect and improve access to within our community."
  },
  {
    "location": "Charlottesville, VA, 22903",
    "description": "Who needs a gym!? Help customers bring large donations in, or load purchases into their vehicles. You may even get to ride in the truck with Jeff! Remember, brains and finesse are more important than sheer brawn, so you don’t need to be a football player to apply.\n\n\nResponsibilities:\n\n• Help customers bring large items in and out of their vehicles\n• Work with Store staff to rearrange furniture on the sales floor and in the warehouse\n• Occasional off-site pickups with the Warehouse Coordinator\n\nQualifications:\n\n• Ability to repeatedly move and lift 50 lbs or more\n• Courteous and professional demeanor when assisting customers and donors\n• Willingness to work with diverse partner groups\n• Positive attitude and good interpersonal skills\n\nBenefits:\n\n• Gain valuable work experience in the non-profit sector\n• Flexible schedule\n• Store Discount\n• Support store staff and other volunteers\n• The chance to have a positive impact right here in Charlottesville\n\nTime Commitment: Flexible",
    "causes": [
      "Community",
      "Environment",
      "Homeless & Housing"
    ],
    "goodFor": [
      "Teens",
      "People 55+",
      "Public Groups"
    ],
    "skills": [
      "Warehousing",
      "Customer Service",
      "Delivery",
      "Critical Thinking",
      "People Skills",
      "Problem Solving"
    ],
    "missionStatement": "The Habitat Store supports Habitat for Humanity of Greater Charlottesville by selling new and used furniture and building materials to the public at discount prices. Our donations come from various places in our community, and all our proceeds help fund our organization's mission to provide affordable housing in the Greater Charlottesville area.",
    "organizationDescription": "The Habitat Store was established in May of 2003 to provide a self-sustaining funding source to HFHGC. We also seek to extend Habitat's mission by making home maintenance and furnishing more affordable. A secondary, environmental benefit of the store is the reuse of second-hand furniture and building materials, which helps to reduce waste in our community."
  },
  {
    "location": "Charlottesville, VA, 22902",
    "description": "Camp Invention is looking for Leadership Interns! Are you looking for the ultimate resume and college application builder? If so, we have an opportunity for you to hone your mentoring skills, obtain valuable leadership traits, and gain intellectual property knowledge.\n\n\nLeadership Interns will receive formalized, online leadership training from a professional coaching and training organization, mentor and inspire Camp Invention Counselors-in-Training and campers, earn up to 40 volunteer hours, receive a letter of recognition from the United States Patent and Trademark Office and more! Space is limited so register for your spot today! For additional information on this opportunity, please contact Annette Crawford at acrawford@invent.org",
    "causes": [
      "Children & Youth"
    ],
    "goodFor": null,
    "skills": [
      "Child Development",
      "Critical Thinking",
      "Problem Solving",
      "Relationship Building",
      "Special Needs",
      "STEM"
    ],
    "missionStatement": "Camp Invention is the only nationally recognized, non-profit elementary enrichment program inspired by the brightest inventors around, the National Inventors Hall of Fame Inductees. Our programs bring out a child’s natural desire to discover, encourages them to problem solve by inventing a solution, and we do it with certified local instructors in local schools.",
    "organizationDescription": "At Camp Invention children are presented with fun, hands-on challenges that encourage creative problem solving, teamwork, entrepreneurship, and innovation. Camp invention is led by experienced local educators and new curriculum is introduced each year, inspired by the Inductees of the National Inventors Hall of Fame!"
  },
  {
    "location": "Charlottesville, VA, 22903",
    "description": "Help cancer patients in your community get to life-saving medical appointments.\n\n\nVolunteers with Road To Recovery use their personal vehicle to drive patients with limited or no transportation to cancer-related treatment appointments.\n\n\nRides are weekdays. You choose the rides that work with your schedule. Drivers are encouraged to provide a minimum of 2 rides per month.\n\n\nVolunteer drivers are ages 18-84 with\n\n• a safe driving record,\n• a current license,\n• a reliable vehicle, and vehicle insurance.\n\nVolunteers interested complete online training and a background check. Volunteers review available rides via an online scheduling tool.\n\n\nWe would love your help!",
    "causes": [
      "Community",
      "Health & Medicine"
    ],
    "goodFor": [
      "People 55+"
    ],
    "skills": [
      "Transportation",
      "Basic Computer Skills",
      "Organization",
      "People Skills",
      "Verbal / Written Communication"
    ],
    "missionStatement": "The American Cancer Society is the nationwide, community-based, voluntary health organization dedicated to eliminating cancer as a major health problem by preventing cancer, saving lives, and diminishing suffering from cancer, through research, education, advocacy, and service. Help us end cancer as we know it., for everyone.",
    "organizationDescription": "The American Cancer Society is a global grassroots force of nearly 2 million volunteers dedicated to saving lives, celebrating lives, and leading the fight for a world without cancer. From breakthrough research, to free lodging near treatment, a 24/7/365 live helpline, free rides to treatment, and convening powerful activists to create awareness and impact, the Society is the only organization attacking cancer from every angle."
  },
  {
    "location": "Charlottesville, VA, 22902",
    "description": "MENTORING at C4K...Mentors provide weekly, hour-long, sessions over one semester (4 months). Learning partners spend their time engaging in hands-on activities, learning new skills, exploring software applications, and producing projects that have meaning and relevance in their lives. Each pair’s projects represent an investment of time and effort together and result in the demonstration of mastery of new skills.\n\n1:1 Mentoring\n\nGet matched with one of our youth members and work on exciting STEAM projects together.Group Mentoring Create and explore alongside our youth members in our Clubhouse Mentors create a positive impact on the lives of local youth. Through meaningful engagement with student interests, mentoring encourages both personal and professional growth and social and economic development.\n\n\nSuccessful mentors are curious with an openness  to learning together. It is essential to have a genuine interest in working with youth. C4K provides mentors with training, support, and access to learning tools. Mentors just need to bring curiosity and excitement.\n\n\nContact C4K to learn more!",
    "causes": [
      "Children & Youth",
      "Computers & Technology",
      "Education & Literacy"
    ],
    "goodFor": null,
    "skills": [
      "Mentoring",
      "Photography",
      "STEM",
      "System Engineering",
      "Music Arts",
      "Mechanical Engineering"
    ],
    "missionStatement": "We combine mentoring and technology to prepare youth for brighter futures!",
    "organizationDescription": "Inspire the next generation by becoming a mentor for youth at C4K."
  },
  {
    "location": "Charlottesville, VA, 22902",
    "description": "The Albemarle Charlottesville Historical Society (ACHS) is preparing to open its doors! We need some friendly faces to welcome visitors to the Historical Society, tell them about ACHS programs and projects, and point them to other great things to do in the Charlottesville area. If you like meeting people and sharing your knowledge of all things Cville, please contact us!",
    "causes": [
      "Arts & Culture",
      "Community",
      "Education & Literacy"
    ],
    "goodFor": null,
    "skills": [
      "Public Relations",
      "Administrative Support",
      "Customer Service",
      "People Skills"
    ],
    "missionStatement": "The Albemarle Charlottesville Historical Society nurtures and promotes awareness and appreciation of local history by encouraging the identification, collection, study, and preservation of the materials of history; by striving for excellence and quality in research and interpretation of collections and local history; and by disseminating knowledge through educational activities, so that the past may shed light on the present and the future.",
    "organizationDescription": "Founded in 1940, the Albemarle Charlottesville Historical Society (Society) is a private, non-profit educational organization (IRS 501 (c) 3) that seeks to study, preserve, and promote the history of Charlottesville and Albemarle County, Virginia. The Society is a membership organization, open to all, and receives no continuing operating support from federal, state or local governments but rather relies on membership fees, gifts and donations, and grants from private foundations. The Society's research library, administered by a librarian on the staff of the Jefferson-Madison Regional Library, contains over 2,000 books and bound periodicals, as well as manuscripts, maps, pamphlets, newspapers, and vertical files relating to the history of our community. Additionally, the archival collection contains over 1,500 artifacts of historical significance to Charlottesville and Albemarle County in addition to over 60,000 photographic images. The Society is located in downtown Charlottesville in the historic McIntire Building. Designed in the Beaux Arts style by architect Walter Dabney Blair, the McIntire Buidling was completed in 1921 and donated by local civic benefactor Paul Goodloe McIntire to the City of Charlottesville as the city's first municipal library. Following an extensive renovation by the Society of this city-owned building in 1993 and the Society moved into it in January 1994."
  },
  {
    "location": "Charlottesville, VA, 22903",
    "description": "I would love to have your help at our home and peaceful gardens in Charlottesville, southwest of Washington, DC. We're next to the University of Virginia - so there is plenty to do.\n\n\nIf you prefer, there are peaceful forests at the end of our street and many great walks and hiking trails nearby in the beautiful Blue Ridge Mountains. We are in wine-producing country, among much of America's early history.\n\n\nThe city has many cafes and restaurants, concerts and a good cultural life. You can also see a short video about the town at https://www.youtube.com/watch?v=aQ0QhUX0634  I need help with some landscaping, and a few jobs in the house.  We usually grow fruit and vegetables - including several kinds of melons. I run a building/real estate business and two non-profit foundations. I am a happily divorced dad; having grown up in England, I have lived in the USA for many years.\n\n\nOur volunteer program is intended for individuals who are usually 18-35, but please feel free to email even if you are slightly outside that range.  We are a warm and welcoming household, and we love our volunteers. You'll be part of the family. Many of our helpers remain friends for life.  We are kind and compassionate - and we want you to be happy.\n\n\nIn the words of Psalm 101: \"I will surround myself with honest people.  I will stay away from evil.  I will not endure conceit or arrogance, but will search for faithful people to be my companions.   I will work with people that I can trust, and who are completely honest.\" Of course, I will look after you and give you wonderful food. We have fast Wi-Fi, laundry facilities and anything else you might need.  I look forward to talking to you!",
    "causes": [
      "Environment",
      "Faith-Based",
      "International"
    ],
    "goodFor": [
      "Teens"
    ],
    "skills": [
      "Landscaping",
      "Interior Design",
      "Business Development",
      "Real Estate & Leasing",
      "Construction",
      "Home Repair"
    ],
    "missionStatement": "Our non-profit foundation encourages personal and national renewal through America's founding principles of faith, liberty, and compassionate entrepreneurship.",
    "organizationDescription": "The American Renewal Foundation was founded in May 1995, so it is in its twentieth year. The Foundation supports classical music in broadcast and performance, particularly in our area. The volunteer opportunity is part is our student program, which hosts overseas and American students for short-term internships. The Foundation arranges travel opportunities around the world for our students, including visits to Europe, Israel and other countries, annual trips to the Caribbean to study marine life, as well as any other interesting destinations."
  },
  {
    "location": "Charlottesville, VA, 22902",
    "description": "Opportunity for families & individuals in Charlottesville and surrounding area ! Ready to have a fun experience? Ready to enjoy some cultural diversity? Ready to get inspired?\n\n\nInvite an international high school student to your home for a few weeks, a semester or even a full school year! Hosting is an amazing experience that will enrich, not only yourself and your family, but also schools and the entire community. Host families come in all shapes and sizes. You may be a single parent, an empty-nester, a couple with or without children - All family dynamics are welcome!\n\n\nOur students are 15-18 years old and they come from Europe, Asia, Oceania and Latin America. They are carefully selected and come with full health insurance, spending money and they speak English well. And you can of course choose your own student. As a host family, you provide room and meals while at home, and a loving family to be a part of.\n\n\nInternational Cultural Exchange Services is a nonprofit student exchange organization, that has helped connecting international students with American families for over 30 years.\n\n\nContact us today to learn more about this amazing and life-changing opportunity!\n\n\nYou may also find us online at www.icesusa.org. Thank You!",
    "causes": [
      "Arts & Culture",
      "Children & Youth",
      "Sports & Recreation"
    ],
    "goodFor": null,
    "skills": null,
    "missionStatement": "ICES is a nonprofit organization dedicated to promoting a peaceful world by increasing international awareness and understanding through cultural sharing experiences. As the global community we live in becomes increasingly interdependent and subject to change, today's young people will face numerous challenges on the journey to becoming tomorrow's leaders. We believe the foreign student exchange experience helps young people of all nationalities embrace those challenges and discover new opportunities that will help them dream and achieve more than they ever thought possible.",
    "organizationDescription": "Founded in 1991, ICES is a nonprofit organization dedicated to increasing awareness and understanding among the peoples of the world. ICES has accomplished this goal for many thousands of exchange student through its dedicated volunteers and international partners."
  },
  {
    "location": "Charlottesville, VA, 22903",
    "description": "WHEELSFORALL is looking for active members for its cause of helping families in under supported causes all over the world. Be part of the change and take action within the multiple departments of our organization. Get the ability to refine abilities and use your skills to help others in need. We have multiple opportunities within:\n\n• Social Media Team\n• Podcast Team\n• Science Team ( Biology, Chem, and Psychology)\n• Business Team\n• Website Team\n• Engineering Team\n\n\nGet to work with multiple students across the world and be part of the active member community. Join us!",
    "causes": [
      "Board Development",
      "Children & Youth",
      "Community"
    ],
    "goodFor": null,
    "skills": [
      "Graphic Design / Print",
      "Mechanical Engineering",
      "Business Development",
      "Advertising",
      "Journalism",
      "Basic Computer Skills"
    ],
    "missionStatement": "We are a high school student-led non-profit organization dedicated to help provide free and reliable transportation to low income families.",
    "organizationDescription": "WHEELSFORALL is a national non-profit organization that works on providing resources to low income families. We have donated over 100 bikes across 4 states and thrive to help the community in multiple areas. The organization is high school student led in order for the youth to have active engagement within the community. We have also helped hundreds of families with free public tutoring, care packages, and food drives in order to spread out the ways we can help our community. WHEELSFORALL has one goal: to help its community it any way it can and have an impact on someone's life."
  },
  {
    "location": "Charlottesville, VA, 22903",
    "description": "Literacy Volunteers Charlottesville/Albemarle is seeking volunteer tutors to assist adults in learning how to read, write, or speak English. Many of our students are refugees and immigrants.\n\n\nWondering if becoming a tutor is right for you? Come to an information session to learn more about our mission, our students, and what it takes to be a literacy volunteer. This one hour session is a virtual and held on Zoom. You can learn more or register directly at literacyforall.org/tutors\n\n\nPlease note that volunteer tutors need to reside in the Greater Charlottesville, Virginia area.",
    "causes": [
      "Community",
      "Education & Literacy",
      "Immigrants & Refugees"
    ],
    "goodFor": [
      "People 55+"
    ],
    "skills": [
      "Tutoring",
      "Mentoring",
      "Literacy / Reading",
      "English as a Secondary Language (ESL)",
      "Adult Education",
      "Reading / Writing"
    ],
    "missionStatement": "LVCA promotes adult literacy through equitable, inclusive, free, confidential, one-to-one English and Citizenship tutoring.",
    "organizationDescription": "We believe all adults should have the ability to understand, speak, read, write, and communicate in English so that they can fully participate in our community."
  },
  {
    "location": "Charlottesville, VA, 22903",
    "description": "Volunteer working on the environment and climate change with our grassroots climate group!\n\n\nCCL volunteers work with their community and members of Congress on climate change solutions. We are organized into more than 450 local chapters across the U.S.\n\n\nYour activities might include:\n\n• Educating the community about global warming and legislative solutions\n• Meeting with congressional leaders\n• Writing letters to the editor\n• Hosting film screenings and panel conversations\n• Meeting with local media\n\n\n\n\nWe also have options available for working on your own or virtually.\n\n\n\n\n\nWant to know more?\n\n\nWe offer a weekly livestream Informational Session every Wednesday and there are opportunities to ask questions: https://citizensclimatelobby.org/informational-session/",
    "causes": [
      "Community",
      "Environment",
      "Politics"
    ],
    "goodFor": [
      "Teens",
      "People 55+",
      "Public Groups"
    ],
    "skills": [
      "Advocacy",
      "Community Outreach",
      "Networking",
      "Public Speaking",
      "Relationship Building",
      "Verbal / Written Communication"
    ],
    "missionStatement": "We build political will for a livable world.",
    "organizationDescription": "CCL empowers everyday people to work with their community and their members of Congress on climate change solutions. Our supporters cover the political spectrum and work in more than 450 local chapters. Together, we’re building support for big solutions to climate change."
  },
  {
    "location": "Charlottesville, VA, 22901",
    "description": "Lasagna Love is a global movement with thousands of people cooking and delivering meals to families in their communities. What we do is simple: we feed families, spread kindness, and strengthen communities. Our mission is not only to help address the incredible rise in food insecurity among families but also to provide a simple act of love and kindness during this time full of uncertainty and stress.Lasagna Love matches neighbors who can provide a meal with a neighbor who needs a little help. You can decide how often you participate - once a month, multiple lasagnas weekly, or somewhere in between. You decide how far you can drive to deliver a meal, and if you can accommodate special diets like vegetarian or gluten free. The Lasagna Love Team does the best to match you with a neighbor in need. We also provide online trainings to help you get started and drop off meals contact free, recipes if you are looking for inspiration, and any other support you need. If you are looking for a flexible volunteer opportunity, or a way for your family to volunteer together to make a meal for a neighbor in need, this is a great opportunity to spread some kindness.",
    "causes": [
      "Community",
      "Hunger",
      "Seniors"
    ],
    "goodFor": [
      "Kids",
      "Teens",
      "People 55+",
      "Public Groups"
    ],
    "skills": null,
    "missionStatement": "Lasagna Love was started at the beginning of the pandemic, when the founder of Good to Mama was looking for a way to help moms in her community. She and her toddler started making and delivering meals to families in the neighborhood who were struggling, whether that struggle was financial, emotional, or simply a feeling of overwhelm. Lasagna Love has since grown into a global grassroots movement, with thousands of people all cooking and delivering meals to families in their communities. What we do is simple: feed families, spread kindness, and strengthen communities. Our mission is not only to help address the incredible rise in food insecurity among families, but also to provide a simple act of love and kindness during a time full of uncertainty and stress.",
    "organizationDescription": "Thousands of volunteers in all 50 states, Canada and Australia delivering home-cooked meals to spread love and kindness."
  },
  {
    "location": "Charlottesville, VA, 22901",
    "description": "Volunteer to Host a Foreign Exchange Student in your town and surrounding areas!! Benefit from opening your home and heart to an exchange student for a term during the upcoming high school year by: - Making life-long friendship connections abroad - Giving a young person an opportunity to immerse themselves in our American culture and your family - Gaining an international son/daughter\n\n\n- Gain new perspectives on our American way of life through the eyes of your exchange student\n\n\nChoose from these ways to host; Welcome Family, a Semester, or school Year. You don't have to have your own child in high school to host. You may be a Couple, with or without children, Single, Empty-nester or Grandparents. Many different family dynamics make for great hosts.\n\n\nAnd yes, you get to pick the student(s) you wish to host by reviewing our student profiles. Our exchange students, ages 15-18, have worked hard to be accepted into our program and are waiting now to be selected by their US host family.  This year's NWSE exchange students come from Spain, France, Germany, Italy, Switzerland, Japan, Czech Republic, Kazakhstan and more! They arrive with English fluency, travel medical insurance and their own spending money. We ask our hosts to provide a loving, caring environment, 3 meals per day and a bedroom, which can be shared with a host sibling of the same gender 12 and up. Students attend the high school your home is zoned for. #ExChange Your World...Become a NWSE Host Family today. Visit nwse.com/host\n\n\nWe look forward to hearing from you very soon and matching you with your foreign exchange student!",
    "causes": [
      "Children & Youth",
      "Education & Literacy",
      "International"
    ],
    "goodFor": [
      "Kids",
      "Teens",
      "People 55+",
      "Public Groups"
    ],
    "skills": null,
    "missionStatement": "NWSE believes international exchanges maximize intercultural understanding and motivate participants, including host families, to familiarize themselves with different cultures, thereby broadening their horizons and contributing to increased international respect and cooperation. Furthermore, by developing their intercultural understanding and ability to solve problems in a global context, student participants gain invaluable skills as they enter the world job market.",
    "organizationDescription": "NWSE places international high school students with host families and high schools in the United States for periods of one semester or one academic year. NWSE offers similar programs to US students who want to student abroad. NWSE works through area representatives (called Academic Coordinators), who recruit hosts and schools and monitor programs throughout the students' exchanges."
  },
  {
    "location": "Charlottesville, VA, 22902",
    "description": "YOU are the driving force behind the next breakthrough in children's cancer research. The CureSearch Walk brings supporters together to raise critical funds to drive the development of safer, more effective treatments for the more than 15,000 children diagnosed every year. As we walk, we'll honor and remember all those affected by this devastating disease.We Need a few volunteers to help set up, work registration, assist with directing walkers, run activity booths and breakdown.Come by a part of a wonderful community event in Charlottesville!",
    "causes": [
      "Board Development",
      "Children & Youth",
      "Health & Medicine"
    ],
    "goodFor": [
      "Kids",
      "Teens",
      "Public Groups"
    ],
    "skills": [
      "Event Management",
      "Fundraising",
      "Community Outreach"
    ],
    "missionStatement": "Our mission is to end childhood cancer by driving targeted and innovative research with measurable results in an accelerated time frame.",
    "organizationDescription": "CureSearch for Children’s Cancer is a national non-profit foundation that accelerates the search for cures for children’s cancer by driving innovation, transcending research barriers and solving the field’s most challenging problems. We fight every day to make treatments and cures possible for the 47 children diagnosed with cancer each day. We do this in three ways:"
  },
  {
    "location": "Charlottesville, VA, 22903",
    "description": "Board Member, Virginia Chapter\n\n\nhttps://giftofadoption.org/virginia/\n\n\n\n\n\nBoard Member\n\n\n\n\n\nCompany Description\n\n\n\n\n\nGift of Adoption is a national charity that provides grants of up to $15,000 to complete the adoptions of children in vulnerable circumstances from the U.S. and around the world. Priority is placed on helping children for whom reunification is not possible and are facing what is possibly their last or only chance at adoption, including those at-risk of separation from siblings, entering foster care, aging-out of an orphanage, or with critical special needs.\n\n\n\n\n\nGift of Adoption is the largest provider of adoption assistance grants on a nondiscriminatory basis (without regard to age, race, ethnicity, religion, sexual orientation, or marital status). Since inception in 1996, and as of July 2024, Gift of Adoption has awarded $18.5 million to give 5,777 children permanent families and the chance to thrive. Gift of Adoption is recognized by Charity Navigator and the Better Business Bureau's Wise Giving Alliance.\n\n\n\n\n\nWant to make a difference? Join a Gift of Adoption Chapter Board!\n\n\n\n\n\nOur Values: Honor, Amplify and Be Scrappy\n\n\n\n\n\nGift of Adoption Needs YOU if:\n\n\nØ You are passionate about the Gift of Adoption mission.\n\n\nØ You have the time and energy to spend 6 hours a month working with your board colleagues to raise funds in a collaborative team environment.\n\n\nØ You can leverage connections, networks, and resources in achieving your chapter’s goals.\n\n\n\n\n\nWe are especially interested in talking with you if:\n\n\nØ You have been a part of nonprofit boards or fundraising committees.\n\n\nØ You have experience in event planning, grant writing, or major gifts.\n\n\nØ You will work diligently to meet your personal give/get goal.\n\n\nØ You are willing to bring your unique background, talent, and passion to the table.\n\n\n\n\n\nNext Steps\n\n\nGift of Adoption chapter board members serve 3-year terms. Each board member is tasked with recruiting one new board member to their chapter team by the completion of each term. This is a non-compensatory, volunteer chapter board role. Our chapter board members are impactful and game changers. Please visit our website   www.giftofadoption.org  for more information.",
    "causes": [
      "Advocacy & Human Rights",
      "Board Development",
      "Children & Youth"
    ],
    "goodFor": [
      "People 55+"
    ],
    "skills": [
      "Public Relations",
      "Event Planning / Management",
      "Social Media / Blogging",
      "Donor Management",
      "Fundraising",
      "Networking"
    ],
    "missionStatement": "Gift of Adoption is a national charitable organization that inspires adoption by providing grants to help fund adoptions-- giving children permanent, loving families and the chance to thrive.",
    "organizationDescription": "We believe a child without a family is one of life's great tragedies because a child without a permanent home suffers. Orphanages and foster homes do not offer permanent solutions for the millions of children who need families. All children deserve the dignity and love that comes from being a part of a family. Gift of Adoption is committed to creating those families. Gift of Adoption is a national charitable organization that inspires adoption by providing grants to help fund adoptions-- giving children permanent, loving families and the chance to thrive."
  },
  {
    "location": "Charlottesville, VA, 22903",
    "description": "We at Central Virginia SCORE invite exceptional people to join our team of dedicated volunteers to help build the future of small business in our community. Small businesses are the backbone of neighborhoods and the economy. SCORE has been providing them with free mentoring and low cost webinars and workshops for over 50 years. The Central VA chapter needs motivated, dynamic people with business or related skills to mentor our growing numbers of clients. If you are looking to make a difference, SCORE is the right place for you.A SCORE mentor is an adviser who uses their expertise to help entrepreneurs launch their dreams...and small business owners reach their goals.  Mentors provide free business advice and guidance using the knowledge acquired from their career experiences and ongoing learning at SCORE......all delivered virtually or in person in a few hours per month on a self-managed schedule.\n\n\nThe ideal mentor is a good listener, curious, empathetic, flexible, and thrives on helping others succeed. Mentors often have significant experience within their field, excellent communication skills, and the ability to dedicate a few hours a month from the comfort of home or in face-to-face meetings.\n\n\nApply to be a mentor in Central Virginia if you have experience as a business owner, or in a corporate functional role or general management, or in business or commerce education, or other business related profession including but not limited to marketing, finance and accounting, information technology, etc. Or view other volunteer opportunities on our website.\n\n\nSCORE is a nonprofit resource partner of the U.S. Small Business Administration that helps aspiring and existing entrepreneurs succeed. Every year, our volunteers help thousands of entrepreneurs achieve their dreams of starting small businesses and achieving new levels of success. Volunteering is a way for you to give back, network with business experts, and share your knowledge. Join SCORE today to make a meaningful difference in Charlottesville, Fredericksburg, Culpeper and the surrounding counties of Central Virginia.\n\n\nLearn more at: https://www.score.org/volunteerOr contact me: tom.davis@scorevolunteer.org",
    "causes": [
      "Community",
      "Employment"
    ],
    "goodFor": null,
    "skills": [
      "Mentoring",
      "People Skills",
      "Relationship Building",
      "Basic Computer Skills",
      "Verbal / Written Communication",
      "Problem Solving"
    ],
    "missionStatement": "SCORE, a 501(c)(3) nonprofit organization, is dedicated to helping small businesses get off the ground, grow and achieve their goals through education and mentoring. Our mission is to foster vibrant small business communities through mentoring and education.",
    "organizationDescription": "SCORE, America's premier source of free and confidential small business advice for entrepreneurs and small businesses, is a nonprofit resource partner with the U.S. Small Business Administration (SBA). We have over 300 SCORE offices across the country and 10,000 volunteers offering free business mentoring and low- or no-cost workshops. For over 50 years, SCORE's thousands of working and retired business professionals have volunteered to support the success of small business nationwide. SCORE business mentoring is free and confidential. We provide:"
  },
  {
    "location": "Charlottesville, VA, 22903",
    "description": "TIME COMMITMENT: On call with a minimum 6 month commitment\n\n\nBACKGROUND: Founded in 1933, the International Rescue Committee is a leading, non-sectarian, non-profit organization providing emergency relief, protection, rehabilitation assistance, resettlement services, and advocacy for refugees and victims of oppression or violent conflict.  Domestically, our 25 offices across the U.S. ensure new arrivals have food, shelter, and clothing, and work with refugees to help them gain self-sufficiency.\n\n\nSCOPE OF WORK: Volunteers will accompany the Casework Specialist in providing transportation of newly-arrived clients from the airport or other pickup location to their housing location. Volunteers must be able to pick clients up outside of regular business hours to accommodate late flight and other transportation schedules (i.e. post-10pm).\n\n\nRESPONSIBILITIES:\n\n\n* Attend Volunteer Orientation\n\n\n* Must undergo and pass a background check. The IRC kindly requests a $35 fee to assist in covering the cost of this requirement\n\n\n* Accompany Caseworker to transport newly-arrived clients from the airport or other pickup location to their housing location\n\n\n* Advocate for clients during delivery of needed services; represent IRC in a professional manner\n\n\n* Record hours and submit completed timesheet for each month via the IRC’s online Volunteer Dashboard.\n\n\nREQUIREMENTS:\n\n\n* Must be comfortable with working evenings and/or nights\n\n\n* Comfortable working in a multicultural environment\n\n\n* Flexible, able to work in a fast-paced, dynamic environment\n\n\n* Excellent written and verbal communication skills\n\n\n* Reliable, responsible, able to complete tasks within required time-frame\n\n\n* Must have a car and a clean driving record\n\n\n* Must be located in Charlottesville, Virginia and be willing to complete field work.",
    "causes": [
      "Immigrants & Refugees"
    ],
    "goodFor": null,
    "skills": null,
    "missionStatement": "The International Rescue Committee (IRC) helps people affected by humanitarian crises--including the climate crisis--to survive, recover and rebuild their lives.",
    "organizationDescription": "The International Rescue Committee provides opportunities for refugees, asylees, victims of human trafficking, survivors of torture, and other immigrants to thrive in America. Each year, thousands of people, forced to flee violence and persecution, are welcomed by the people of the United States into the safety and freedom of America. These individuals have survived against incredible odds. The IRC works with government bodies, civil society actors, and local volunteers to help them translate their past experiences into assets that are valuable to their new communities. In Charlottesville and other offices across the country, the IRC helps them to rebuild their lives."
  },
  {
    "location": "Charlottesville, VA, 22902",
    "description": "You've heard of Habitat for Humanity and guess what? We host college groups just like yours to help us build homes across the nation. If you are looking for an alternative, volunteer based spring break activity for 10-25 of your college students keep reading,\n\n\nBuild with us in Charlottesville, Virginia! You'll have the chance to work on multiple construction sites right in Thomas Jefferson's hometown. We are building simple, decent, affordable homes in partnership with low-income families with the support of volunteers in the greater Charlottesville community. We believe in diverse, inclusive, and vibrant communities of neighbors that transcend socioeconomic and cultural divides. It takes everyone working together to build community! And we need volunteers like you to make this dream a reality!\n\n\nWHO:Students ages 18+ and college program leaders seeking an impactful volunteer opportunity with Habitat for Humanity! Groups of five or more are welcome, with optional chaperones (25+).\n\n\nWHAT:Join Collegiate Challenge, Habitat for Humanity's long-running alternative break program, where students work together on hands-on projects that make a lasting impact in communities across the U.S.\n\n\nWHEN:Choose a week that works for you! Collegiate Challenge offers flexible volunteer weeks during school breaks and year-round, so your team can choose dates that fit.\n\n\nWHERE:Charlottesville, VA! But if you are interested in other locations just know that we have build sites in diverse communities across the United States. Whether you want to stay close to your school or travel to a new location, many U.S. Habitat affiliates offer this program.\n\n\nWHY:Make your break meaningful! Beyond building homes, you’ll be creating hope and a stronger community spirit. It’s an unforgettable, purpose-driven experience that makes a real impact and brings you closer to friends, classmates, and new people alike.\n\n\nHOW:Ready to make it happen? Visit http://habitat.org/collegiatechallenge to apply. Sign up with your group, and start preparing for a rewarding journey that combines volunteering with an immersive cultural experience.",
    "causes": [
      "Advocacy & Human Rights",
      "Community",
      "Homeless & Housing"
    ],
    "goodFor": [
      "Teens",
      "Public Groups"
    ],
    "skills": [
      "Disaster Cleanup",
      "Renovation",
      "Construction",
      "Electrical",
      "Home Repair",
      "Carpentry"
    ],
    "missionStatement": "Seeking to put God’s love into action, Habitat for Humanity brings people together to build homes, communities, and hope. We partner with people in your community and all over the world to help them build or improve a place they can call home. Habitat homeowners help build their own homes alongside volunteers and pay an affordable mortgage. With your support, Habitat homeowners achieve the strength, stability, and independence they need to build a better life for themselves and for their families. Through our work, we strive to achieve our vision of a world where everyone has a decent place to live.",
    "organizationDescription": "Collegiate Challenge is an alternative break program that strives to capture the imagination, energy, and hope of young people in order to productively and responsibly involve them in the work of Habitat for a week."
  },
  {
    "location": "Charlottesville, VA, 22901",
    "description": "Our volunteers work one-on-one with unaccompanied migrant children to connect with them and advocate for their rights.\n\n\nWe have some basic requirements to volunteering with us:\n\n• Must be at least 21 years old\n• Speak a language other than English\n• We ask they have access to a car to get to meetings with the child\n\nWe will be hosting a training on March 22nd and 23rd in-person in Washington, DC. However, if you are not able to attend the training, please still apply as we will have more trainings this year in both virtual and in-person formats.",
    "causes": [
      "Advocacy & Human Rights",
      "Children & Youth",
      "Immigrants & Refugees"
    ],
    "goodFor": null,
    "skills": null,
    "missionStatement": "The mission of the Young Center for Immigrant Children’s Rights is to promote the best interests of unaccompanied immigrant children with due regard to the child’s expressed wishes. The Young Center is a champion for the best interests of children who arrive in the United States on their own, from all corners of the world. We serve as trusted allies for these children while they are in court proceedings, advocating for their best interests, and standing for the creation of a dedicated children’s immigrant justice system that ensures the safety and well-being of every child.",
    "organizationDescription": "The Young Center provides Child Advocates for unaccompanied immigrant children in federal custody. Our model works with volunteer Child Advocates who participate in a Young Center training, meet with a child on a weekly basis, and learn the child’s story, all supervised and supported by Young Center staff."
  },
  {
    "location": "Charlottesville, VA, 22904",
    "description": "Do you want to make a difference in a young person's life while you learn about another culture, create and build friendships and make ever-lasting memories? Do you have a caring heart and extra space in your home? AnB Education is looking for you! Make a difference today and host an international student!\n\n\n\n\n\nAll our students need is:\n\n• A bedroom (can be shared with host sibling)\n• 3 meals a day\n• Transportation to and from school, if there are no school buses provided\n• A welcoming family! :)\n\n\n\n\n*All other expenses (activity fees, personal items, etc.) are paid for by the student and their natural parents. There is NO monetary compensation for hosting a J-1 exchange student.\n\n\n\n\n\nExchange students are between the ages of 15 and 18. AnB Education will get the students enrolled at your local public high school and provide support throughout the program year. We have a Local Coordinator in the area who is excited to work with you!\n\n\n\n\n\nAnB Education is currently looking for host families in your area to host our incoming students from Europe, Asia, and South America!\n\n\n\n\n\nPlease contact us for more information! (Include your phone number in your reply so we can reach out).\n\n\n\n\n\nThank you!",
    "causes": [
      "Children & Youth",
      "Education & Literacy",
      "International"
    ],
    "goodFor": null,
    "skills": null,
    "missionStatement": "AnB Education Stands for Above and Beyond Education. \"Inspiring the Dream of Education across all Nations.\" Established in 2009, AnB Education is a non-profit international exchange organization committed to the support of cultural experience along with academic support. AnB Education is appreciated in the exchange student community and known for its family-like atmosphere. As a fully accredited organization, AnB Education is successful with working international students, and it is supported by the Council on Standards for International Educational Travel (CSIET) . And approved by the CA Attorney General's Registry of International Student Exchange Visitor Placement Organizations.",
    "organizationDescription": "AnB Education's number one priority is students’ safety"
  },
  {
    "location": "Charlottesville, VA, 22905",
    "description": "Four Diamonds’ Mini-THON is a K-12 opportunity where students are empowered to become leaders in the fight against childhood cancer. Students gain work ready skills in communication, critical thinking and problem solving, while promoting teamwork, creativity and spirit within their schools.\n\n\nAs a year-long fundraising effort, Mini-THON is an excellent way to become involved in philanthropy and engage both your school and local community. This effort culminates with a multi-hour, fun-filled event involving games, music, dancing, activities, and more!\n\n\nIf you would like to learn more about our organization and our mission, visit https://www.fourdiamonds.org/mini-thon/",
    "causes": [
      "Children & Youth",
      "Community",
      "Health & Medicine"
    ],
    "goodFor": [
      "Kids",
      "Teens"
    ],
    "skills": [
      "Marketing & Communications (Mar/Com)",
      "Public Relations",
      "Strategic Planning",
      "Social Media / Blogging",
      "Fundraising"
    ],
    "missionStatement": "The Four Diamonds mission is to conquer childhood cancer by assisting children and their families through comprehensive support, superior care and innovative research.",
    "organizationDescription": "Four Diamonds covers 100 percent of all medical expenses related to cancer care not covered by insurance for eligible Four Diamonds children. Because of the community's steady and generous support, Four Diamonds has assisted 100 percent of the childhood cancer patients who have been treated at Penn State Children's Hospital."
  },
  {
    "location": "Charlottesville, VA, VA, 22911",
    "description": "Become a hero on your own terms: Volunteer on your own time, in your own way, with your personality and with your own skills.\n\n\nLegacy Hospice is seeking passionate, caring individuals to join our team as volunteers.\n\n\nBecome one of our volunteers and give us the precious gift of your time and interest. In turn, we give you a chance to make a real difference in someone’s life. We train you, find you the right assignment and stand behind you as you grow.\n\n\nLegacy Hospice provides care to all age groups during the final stages of life, including children, adults, and the elderly. Our patients will have an experienced team of physicians, registered nurses, certified nurse aides, medical social workers, counselors, and trained volunteers available to help patients and their family members.\n\n\nThere are different types of volunteers\n\n\n1. Patient/Family Volunteers are part of a patient’s care team. They make home visits to offer companionship for patients and relief for caregivers. Examples of patient care volunteer opportunities include reading to the patient, assisting with a hobby, listening, running errands, or grocery shopping.\n\n\n2. Administrative Volunteers do not work directly with patients and families. Examples of organizational volunteer opportunities include work in Legacy’s office to support our care team or help patients and families through indirect support, such as assisting with Legacy’s Transitions program, creating special memories for holidays, patient birthdays and anniversaries, planting flowers or mowing a yard for a patient that is unable to continue doing so, and helping with other needs of our patients and families.\n\n\n3. Music Therapy or Pet Therapy Volunteers.  Contact us about these specialities so we can discuss requirements and possibilities.\n\n\n\n\n\nSTUDENTS: Are you a college student wishing to get real life experience in a field of study such as medicine or social work? This could be a great opportunity for you!\n\n\n\n\n\nTo apply to be a volunteer visit this site:\n\n\nLegacy Hospice - Serving Virginia:  https://legacy-hospice.com/volunteers.php\n\n\nIf there are questions, please contact the Volunteer Coordinator at (434) 970-7776.",
    "causes": [
      "Health & Medicine"
    ],
    "goodFor": [
      "Teens",
      "People 55+",
      "Public Groups"
    ],
    "skills": [
      "Administrative Support",
      "Animal Care / Handling",
      "Hospice Care",
      "People Skills",
      "Relationship Building",
      "Music Therapy"
    ],
    "missionStatement": "Legacy is focused primarily on comfort and pain management for our patients. Our Key Objectives: Keep patients from unnecessary hospital visits - all too often we see patients nearing the end of their lives unnecessarily traveling to and from the hospital, often via traumatizing ambulance rides. These visits are incredibly disrupting for patients, their caregivers and families and frequently result in negative physical outcomes. Instead, our team of clinicians allows patients to be cared for wherever they call home - providing the comfort and pain management needed to weather any physical disruptions. Engage in frank conversations - Like advance directives, we are firm believers in asking the right questions and knowing how to best achieve the goals.",
    "organizationDescription": "Legacy Hospice provides care to all age groups during the final stages of life, including children, adults, and the elderly. Our patients will have an experienced team of physicians, registered nurses, certified nurse aides, medical social workers, counselors, and trained volunteers available to help patients and their family members ."
  },
  {
    "location": "Charlottesville, VA, 22903",
    "description": "Join a Great Team! Current Opportunities: Clothing Processing, Housewares Processing, Customer Service and Cash Register. 2 hour shifts to fit your schedule. Training provided. Also, you will earn store credits for every hour you volunteer to use in the store toward purchases!",
    "causes": [
      "Advocacy & Human Rights",
      "Community",
      "Seniors"
    ],
    "goodFor": [
      "Teens",
      "People 55+"
    ],
    "skills": [
      "People Skills",
      "Administrative Support",
      "Transactions",
      "Customer Service",
      "Merchandising",
      "Retail / Sales"
    ],
    "missionStatement": "Mission: to raise revenue to benefit seniors in need, while promoting sustainability through the resale of donated clothing, furniture and household items. We value helping seniors, practicing sustainability through recycling and reducing waste, being socially impactful and inclusive, and providing quality products with competitive and affordable prices.",
    "organizationDescription": "Twice is Nice is an entirely donation based upscale resale boutique which features men’s and women’s clothing, accessories, collectibles, home décor, and furnishings generously donated by our community. Shop. Donate. Volunteer."
  },
  {
    "location": "Charlottesville, VA, 22903",
    "description": "Days and times flexible. We welcome from 1 to many volunteers, project depending. We have outdoor projects perfect for a family/household and mostly outdoor work.Fence painting? Trail clearing? Firewood chopping and stacking? Pick up sticks in riding ring (great for kids)!Also some remote options - Web design? Grant Research? More!",
    "causes": [
      "Children & Youth",
      "Community",
      "People with Disabilities"
    ],
    "goodFor": [
      "Kids",
      "Teens",
      "People 55+",
      "Public Groups"
    ],
    "skills": [
      "Grant Writing / Research",
      "Janitorial Maintenance",
      "Administrative Support",
      "Outdoor Recreation",
      "Woodworking",
      "Interior / Exterior Decorating"
    ],
    "missionStatement": "Camp Holiday Trails creates a community that empowers children and teens with medical needs to thrive.",
    "organizationDescription": "Camp Holiday Trails offers children with chronic illnesses the opportunity to take the same positive risks as their healthy peers in an environment that is safe and medically supervised. Our families live every day knowing the physical, emotional, and financial burdens associated with having a child with a chronic illness. Camp Holiday Trails offers an opportunity for these parents to sleep \"with both eyes closed\" knowing their child’s medical needs are being met by a caring staff of counselors, medical/nursing students, and healthcare professionals."
  },
  {
    "location": "Charlottesville, VA, 22903",
    "description": "Recruiting Organization: Live Life With Purpose International, Inc\n\n\nWe are in need of volunteers and leads to manage our concession stand at Virginia Cavaliers Games. This opportunity will help build our community and we would like for you to be apart of it.\n\n\nStipend ProvidedFalse\n\n\nTraining ProvidedFalse\n\n\nHousing AvailableFalse\n\n\nLanguage/Cultral Support AvailableFalse\n\n\nWheelchair AccessibleFalse\n\n\nFee RequiredFalse\n\n\nFee Amount: None\n\n\nThis opportunity is recurring",
    "causes": [
      "Education & Literacy",
      "Homeless & Housing",
      "Women"
    ],
    "goodFor": null,
    "skills": null,
    "missionStatement": "To bridge the gap between intention and action in order to bring about social impact.",
    "organizationDescription": "Idealist is a leading online global resource for finding jobs in the nonprofit sector, as well as volunteer opportunities and graduate school programs for social impact."
  },
  {
    "location": "Charlottesville, VA, 22903",
    "description": "We are in need of volunteers and leads to manage our concession stand at Virginia Cavaliers Games. This opportunity will help build our community and we would like for you to be apart of it.",
    "causes": [
      "Community"
    ],
    "goodFor": [
      "Public Groups"
    ],
    "skills": null,
    "missionStatement": "At Alenza Wellness Community Outreach, our mission is to improve our community by implementing physical and emotional betterment by practicing healthy habits one day at a time.",
    "organizationDescription": "This was developed due to my mom passing 8 years ago from a massive heart attack and sister passing prior to that with breast cancer. I realize that i need to get up and get moving and impact and influence our community with betterment by practicing heathy habits through exercising and being active.I am assisting title one school in Clayton County that is active with dance, football and etc."
  },
  {
    "location": "Charlottesville, VA, 22902",
    "description": "Changing perspectives. Changing lives. ​ Big Brothers Big Sisters of the Central Blue Ridge operates under the belief that inherent in every child is the ability to succeed and thrive in life. As the area’s leading provider of evidence-based mentoring, our agency makes meaningful, monitored matches between adult volunteer mentors (\"Bigs\") and children (\"Littles\"), ages 6 through 16, in the Charlottesville and Albemarle communities.   Our vision: All youth achieve their full potential.  Mission: Create and support one-to-one mentoring relationships that ignite the power and promise of youth.Our Community Based Program:           Bigs and Littles get together on their own to share in fun activities they both enjoy. Matches typically meet for a couple of hours each week or every other week. Some Bigs meet their Littles on the weekends while others get together with their Littles in the evenings. Each match is unique and develops a schedule that works for them. ​We require at least a 12 month commitment from our Bigs and Littles, and an additional 6 month window for enrollment.  Getting together is a great time for both the Big and the Little. It doesn’t require a special occasion or expensive activities; just a couple of hours a week to share the simple things you already like to do. Things like playing at the park, going to a museum, baking cookies, planting a garden or visiting a local orchard.           Matches meet in the community\n\n• What matches do is up to them, but we encourage no cost/low cost activities.\n• Some activity ideas include baking cookies, going to the park, playing sports, riding bikes, volunteering together, or doing arts and crafts.​\n• Outings typically last a couple of hours. ​\n• During the time with their Big, children gain new skills, explore new interests and expand their experience-base beyond their family or neighborhood.",
    "causes": [
      "Children & Youth",
      "Community",
      "Education & Literacy"
    ],
    "goodFor": null,
    "skills": [
      "Visual Arts",
      "Music Arts",
      "Drawing",
      "Painting",
      "Pottery",
      "Child Development"
    ],
    "missionStatement": "Big Brothers Big Sisters is the oldest, largest and most effective youth mentoring organization in the United States. Our mission is to provide children facing adversity with strong and enduring, professionally supported 1-to-1 relationships that change their lives for the better, forever. Independent research shows that the Big Brothers Big Sisters model of professionally supported relationships between young people and their adult mentors has a direct, measurable and lasting impact. Children in our program perform better in school, are less likely to skip classes and school days, and more likely to avoid risky, unhealthy behaviors and have higher self-esteem and aspirations.",
    "organizationDescription": "Big Brothers Big Sisters holds itself accountable to demonstrating outcomes in three critical areas for our Little Brothers and Little Sisters:"
  },
  {
    "location": "Charlottesville, VA, 22901",
    "description": "Companionship volunteers are needed to visit with and enrich the quality of life for a patient with a life-shortening diagnosis who is receiving hospice care. This program, with adequate training, allows volunteers to be matched one on one with a patient. The volunteer will be able to have his/her autonomy to choose various ways to offer kindness through companionship, which may include general dialogue, reading, sharing musical talents, and at times just simply holding their hand. The volunteer can also set their own schedule that is convenient for both parties. Typically, a volunteer would make a companionship visit 2-4 times monthly from approx. 30 minutes to a couple of hours. Additionally, visits could involve helping the family cope by offering respite time as the family member runs errands or running errands for them, helping with light housework or helping to prepare meals. Whether you are retired, a student needing volunteer hours, or just want to make a difference for others, this is an extremely meaningful and rewarding way to contribute to your community.",
    "causes": [
      "Crisis Support",
      "Seniors"
    ],
    "goodFor": [
      "People 55+"
    ],
    "skills": [
      "Hospice Care"
    ],
    "missionStatement": "To provide compassionate care and extraordinary service to the patients and the families we serve.",
    "organizationDescription": "To be the best in class provider of clinically innovative healthcare services in the home."
  },
  {
    "location": "Charlottesville, VA, 22903",
    "description": "Join Our Team as a Companionship Volunteer!\n\n\nAre you a passionate and caring individual looking to make a meaningful difference in your community? Heartland Hospice is seeking dedicated volunteers to be part of our compassionate care team. As a volunteer, you will play a vital role in bringing comfort and companionship to our patients.\n\n\nYour Role:\n\n• Provide companionship to patients through home or facility visits.\n• Offer relief and support to caregivers.\n• Engage in activities like reading to patients, assisting with their hobbies, or simply listening to their life stories.\n\nWhy Volunteer with Us?\n\n• Make a profound impact by offering comfort and support to patients nearing the end of life.\n• Experience the joy of knowing your presence can bring solace during a challenging time.\n• Whether you're retired, a student needing volunteer hours, or someone wanting to contribute positively to your community, this opportunity is both meaningful and rewarding.\n\nJoin us in making a difference. Your compassion and dedication can brighten someone's day and bring comfort when it’s needed the most. We look forward to welcoming you to our team!",
    "causes": [
      "Health & Medicine",
      "Seniors",
      "Veterans & Military Families"
    ],
    "goodFor": [
      "People 55+",
      "Public Groups"
    ],
    "skills": [
      "Administrative Support",
      "Healthcare",
      "Hospice Care",
      "People Skills",
      "Reading Comprehension"
    ],
    "missionStatement": "The mission of Heartland Hospice is to provide compassionate care and extraordinary service to the patients and the families we serve.",
    "organizationDescription": "Heartland Hospice is a team of professionals who provide care to patients and families with end of life needs. As key members of the care team, volunteers expand and enhance hospice services for our patients. Volunteers bring special skills and talents to share with patients, and offer comfort through companionship visits, administrative assistance and special projects for patients and their families."
  },
  {
    "location": "Charlottesville, VA, 22903",
    "description": "The Alzheimer's Association of Central/Western VA is getting ready for an exciting fourth annual Pickleball Event in Charlottesville, VA on Saturday, May 31st. Volunteers are needed in advance and during the event; no pickleball experience necessary!Volunteer Opportunities:\n\n• Event planning and promotion\n• Business partnership acquisition\n• In-kind gift management\n• Event day set up & clean up\n\nProceeds from this event are going directly to the Alzheimer's Association of Central and Western Virginia through The Longest Day Campaign. The Longest Day is a signature fundraising campaign of the Association that helps to fund local Alzheimer's care, support, and research. Are you a Pickleball enthusiast that wants to participate in the Event itself?! Please use the contact info below and we will share registration information.Questions?! Interested?! Respond to this Volunteer Post or contact Emily at emrosenberger@alz.org",
    "causes": [
      "Community",
      "Health & Medicine",
      "Sports & Recreation"
    ],
    "goodFor": [
      "Teens",
      "People 55+",
      "Public Groups"
    ],
    "skills": [
      "Event Management",
      "Fundraising",
      "Community Outreach",
      "Outdoor Recreation",
      "Racquet Sports"
    ],
    "missionStatement": "We are looking to expand our incredible volunteer base with the addition of a Volunteer Chair, Recruitment Subcommittee Chair, and Retention Subcommittee Chair. The end of Alzheimer's can start with you - If you are at all interested please contact us!",
    "organizationDescription": "The Longest Day is the day with the most light - the summer solstice. On June 20, thousands of participants from across the world come together to fight the darkness of Alzheimer's through an activity of their choice. Together, they use their creativity and passion to raise funds and awareness for the care, support and research efforts of the Alzheimer’s Association."
  }
]